[
  {
    "day": 1,
    "title": "Day 1: The Quiet Welcome",
    "content": "Welcome home! For the first 24 hours, keep the cage in a quiet, calm room. Talk to your new bird in a soft voice, but don't try to handle them yet. Let them settle in and get used to their new surroundings."
  },
  {
    "day": 2,
    "title": "Day 2: Introducing Your Voice",
    "content": "Sit near the cage for 10-15 minutes a few times today and talk gently to your cockatiel. Read a book or sing softly. The goal is to teach them that your presence is a calm and positive experience."
  },
  {
    "day": 3,
    "title": "Day 3: The First Offering",
    "content": "Offer a small piece of millet spray or a favorite seed from your hand. Hold it near the cage bars without trying to make the bird come to you. The goal is to associate your hand with treats and positivity."
  },
  {
    "day": 4,
    "title": "Day 4: Opening the Door",
    "content": "With your hand resting on the outside of the cage door, open it slowly. Don't try to reach in. Just let the bird get used to the idea of an open door with your hand nearby. Close it after a few minutes."
  },
  {
    "day": 5,
    "title": "Day 5: Hand in the Cage",
    "content": "Today, place your hand just inside the open cage door, holding a treat. Rest it there without moving towards the bird. This is a big trust-building step. Be patient; it may take a few tries."
  },
  {
    "day": 6,
    "title": "Day 6: The 'Step Up' Command",
    "content": "With your hand inside the cage, gently press your finger against the bird's lower belly and say 'Step up' in a calm voice. The bird may instinctively step onto your finger. If they do, offer praise and a treat."
  },
  {
    "day": 7,
    "title": "Day 7: First Flight",
    "content": "In a bird-proofed room (windows covered, fans off), open the cage door and let your bird come out on its own time. Don't force it. The first out-of-cage experience should be on their terms to build confidence."
  },
  {
    "day": 8,
    "title": "Day 8: All About Pellets",
    "content": "A healthy diet is key. Introduce a high-quality pellet mix today. You can mix it with their old seed mix to encourage them to try it. The goal is to transition to a primarily pellet-based diet."
  },
  {
    "day": 9,
    "title": "Day 9: Veggie Exploration",
    "content": "Offer a small amount of finely chopped, bird-safe vegetables like broccoli, carrots, or kale. Present it in a separate dish. Don't worry if they don't eat it at first; it's all about exposure."
  },
  {
    "day": 10,
    "title": "Day 10: Reinforce 'Step Up'",
    "content": "Practice the 'Step up' command inside the cage a few times today. Keep sessions short and positive, always ending with praise or a small treat. Consistency is key."
  },
  {
    "day": 11,
    "title": "Day 11: The Importance of Routine",
    "content": "Birds thrive on routine. Try to uncover their cage around the same time each morning and cover it at night. This helps regulate their sleep cycle and reduces stress."
  },
  {
    "day": 12,
    "title": "Day 12: Introduce a New Toy",
    "content": "Introduce a new, simple toy, like a small shreddable toy or a bell. Place it in the cage and let your bird explore it on their own terms. This provides mental stimulation."
  },
  {
    "day": 13,
    "title": "Day 13: Target Training 101",
    "content": "Target training is a powerful tool. Hold a chopstick or a small stick near the bird. When they touch it with their beak, say 'Good!' and give them a treat. This will be the foundation for many future tricks."
  },
  {
    "day": 14,
    "title": "Day 14: Listen to Their Sounds",
    "content": "Pay attention to your bird's vocalizations. A soft chirp can be contentment, while a loud flock call might mean they're looking for you. Learning their language deepens your bond."
  },
  {
    "day": 15,
    "title": "Day 15: Foraging Fun",
    "content": "Make mealtime more interesting. Instead of just putting food in a bowl, try hiding a few seeds in a simple foraging toy or a wadded-up piece of paper. This mimics their natural behavior."
  },
  {
    "day": 16,
    "title": "Day 16: Bath Time!",
    "content": "Offer a shallow dish of lukewarm water or lightly mist your bird with a spray bottle. Never force them to bathe. Many cockatiels love bathing, which is essential for feather health."
  },
  {
    "day": 17,
    "title": "Day 17: Out-of-Cage 'Step Up'",
    "content": "While your bird is perched on top of their cage or on a play stand, practice the 'Step up' command. This reinforces that your hand is a safe and reliable perch, no matter where they are."
  },
  {
    "day": 18,
    "title": "Day 18: Understanding Droppings",
    "content": "A healthy bird's droppings are a good indicator of health. They should typically have three parts: a solid green/brown center, a white urate part, and a clear liquid urine. Pay attention to any drastic changes."
  },
  {
    "day": 19,
    "title": "Day 19: The Joy of Beak Grinding",
    "content": "If you hear your bird grinding its beak, especially when they're sleepy, it's a very good sign! This is the cockatiel equivalent of a cat purring; it means they are relaxed and content."
  },
  {
    "day": 20,
    "title": "Day 20: Handling Night Frights",
    "content": "Cockatiels can sometimes have 'night frights,' where they panic and thrash in the dark. A small, dim night light in the room can often help prevent this."
  },
  {
    "day": 21,
    "title": "Day 21: A Healthy Environment",
    "content": "Check the room for potential hazards. Avoid using air fresheners, scented candles, and non-stick cookware with Teflon, as their fumes can be toxic to birds."
  },
  {
    "day": 22,
    "title": "Day 22: Introduce a New Perch",
    "content": "Varying perch sizes and textures is great for your bird's foot health. Introduce a natural wood perch, like one made from apple or bottlebrush wood. Avoid dowel perches for long-term use."
  },
  {
    "day": 23,
    "title": "Day 23: The 'Wave' Trick",
    "content": "Now that your bird knows 'Step up,' you can teach a simple trick. Hold your finger out but slightly out of reach and say 'Wave!' They might lift a foot in anticipation. When they do, reward them!"
  },
  {
    "day": 24,
    "title": "Day 24: Socialization",
    "content": "Let your bird spend time in the same room as the family. The sounds of daily life, like the TV or conversations, help them feel like part of the flock."
  },
  {
    "day": 25,
    "title": "Day 25: Reading Their Crest",
    "content": "Your cockatiel's crest is an emotional barometer. Straight up means they're excited or alarmed. Flattened means they're angry or scared. A relaxed, slightly back crest is a sign of a happy bird."
  },
  {
    "day": 26,
    "title": "Day 26: Building a First-Aid Kit",
    "content": "It's wise to have a small avian first-aid kit. Include items like styptic powder (to stop bleeding from a broken blood feather), antiseptic, and your avian vet's emergency contact number."
  },
  {
    "day": 27,
    "title": "Day 27: Positive Reinforcement",
    "content": "Remember that birds learn best through positive reinforcement. Never punish your bird for biting or screaming. Instead, reward good behavior with praise and treats."
  },
  {
    "day": 28,
    "title": "Day 28: Find an Avian Vet",
    "content": "If you haven't already, now is a great time to find a certified avian veterinarian in your area. Regular check-ups are key to a long and healthy life. Schedule your bird's first wellness visit."
  },
  {
    "day": 29,
    "title": "Day 29: Recall Training",
    "content": "Start practicing 'recall' - having your bird fly to you. Start with a very short distance, like from one end of a perch to the other, while you hold a treat. This is a vital safety skill."
  },
  {
    "day": 30,
    "title": "Day 30: A Month of Growth!",
    "content": "Congratulations! You've successfully navigated the first 30 days. You've built a foundation of trust and learned your bird's basic needs. The journey ahead is full of joy, learning, and companionship."
  }
]